wpax-dcqos2/deathstarbench-social-network/2023-04-03T17-01-24UTC/10000R-1700c-5d-150t/wrk2_10000R_1700c_5d_150t_1iteration.txt
Running 5s test @ http://nginx-thrift:8080
  150 threads and 1700 connections
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     5.55ms    1.89ms  12.44ms   80.93%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    5.04ms
 75.000%    6.18ms
 90.000%    8.01ms
 99.000%   12.44ms
 99.900%   15.75ms
 99.990%   18.93ms
 99.999%   20.88ms
100.000%   20.88ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.517     0.000000            1         1.00
       3.827     0.100000         4791         1.11
       4.159     0.200000         9570         1.25
       4.443     0.300000        14379         1.43
       4.723     0.400000        19140         1.67
       5.039     0.500000        23947         2.00
       5.215     0.550000        26339         2.22
       5.407     0.600000        28720         2.50
       5.623     0.650000        31107         2.86
       5.867     0.700000        33506         3.33
       6.175     0.750000        35893         4.00
       6.363     0.775000        37097         4.44
       6.571     0.800000        38289         5.00
       6.815     0.825000        39477         5.71
       7.127     0.850000        40689         6.67
       7.527     0.875000        41872         8.00
       7.747     0.887500        42467         8.89
       8.007     0.900000        43070        10.00
       8.303     0.912500        43676        11.43
       8.647     0.925000        44262        13.33
       9.023     0.937500        44870        16.00
       9.239     0.943750        45163        17.78
       9.471     0.950000        45460        20.00
       9.759     0.956250        45763        22.86
      10.079     0.962500        46063        26.67
      10.431     0.968750        46360        32.00
      10.623     0.971875        46508        35.56
      10.863     0.975000        46657        40.00
      11.143     0.978125        46809        45.71
      11.447     0.981250        46953        53.33
      11.743     0.984375        47105        64.00
      11.911     0.985938        47179        71.11
      12.095     0.987500        47253        80.00
      12.319     0.989062        47328        91.43
      12.575     0.990625        47404       106.67
      12.799     0.992188        47478       128.00
      13.015     0.992969        47514       142.22
      13.159     0.993750        47552       160.00
      13.367     0.994531        47591       182.86
      13.615     0.995313        47626       213.33
      13.815     0.996094        47664       256.00
      13.959     0.996484        47682       284.44
      14.183     0.996875        47702       320.00
      14.415     0.997266        47720       365.71
      14.567     0.997656        47738       426.67
      14.719     0.998047        47758       512.00
      14.815     0.998242        47766       568.89
      15.095     0.998437        47776       640.00
      15.263     0.998633        47786       731.43
      15.519     0.998828        47794       853.33
      15.799     0.999023        47804      1024.00
      15.863     0.999121        47808      1137.78
      15.991     0.999219        47813      1280.00
      16.231     0.999316        47818      1462.86
      16.367     0.999414        47822      1706.67
      16.639     0.999512        47827      2048.00
      16.799     0.999561        47829      2275.56
      17.055     0.999609        47832      2560.00
      17.199     0.999658        47834      2925.71
      17.343     0.999707        47836      3413.33
      17.519     0.999756        47839      4096.00
      17.583     0.999780        47840      4551.11
      17.695     0.999805        47841      5120.00
      18.095     0.999829        47842      5851.43
      18.463     0.999854        47843      6826.67
      18.927     0.999878        47845      8192.00
      18.927     0.999890        47845      9102.22
      19.263     0.999902        47846     10240.00
      19.263     0.999915        47846     11702.86
      20.367     0.999927        47847     13653.33
      20.527     0.999939        47848     16384.00
      20.527     0.999945        47848     18204.44
      20.527     0.999951        47848     20480.00
      20.527     0.999957        47848     23405.71
      20.863     0.999963        47849     27306.67
      20.863     0.999969        47849     32768.00
      20.863     0.999973        47849     36408.89
      20.863     0.999976        47849     40960.00
      20.863     0.999979        47849     46811.43
      20.879     0.999982        47850     54613.33
      20.879     1.000000        47850          inf
#[Mean    =        5.552, StdDeviation   =        1.888]
#[Max     =       20.864, Total count    =        47850]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  48001 requests in 5.01s, 548.26MB read
Requests/sec:   9587.84
Transfer/sec:    109.51MB